cli+gui.org
#+title: 当纯文本命令行碰到图形界面

很多人对很多事都会表现得很狂热。比如我自己，曾经一度说过这样的话：“我最
爱的是自由软件，最讨厌的是微软公司”。过了几年，有一次我把自己搞失业了，
居然去找在微软工作的同学说，嘿，哥们，能不能帮我推荐一下xxxx号职位？

这不是打自己脸么？

从那之后，我再也不敢轻易地说那种不知深浅的话了。其实微软的东西挺好的。

回到这篇文章的题目，命令行和图形界面。这两种界面特点非常鲜明，可以说水
火不相容。

命令行的优点是高效率。几乎可以完全用键盘操作；魔鬼筋肉人可以最大程度地
利用手指肌肉的机械化记忆而达到非常快的速度；头脑发达的可以组合使用各种
命令行工具达到自己的目的；最后非常容易自动化。

图形界面的优点则是直观。不是有句话叫一图抵千言么。一千个字写得累看得也
累；画一张图可能画得有趣看得也轻松。

而它们的缺点则刚好正是对方的优点。命令行用久了容易累，纯文本的东西需要
吸收消化，对脑子转速要求比较高；图形界面用久也容易累，因为它比较难自动
化，很多操作需要用鼠标完成。

由此带来的一个现象是，爱用纯文本界面的人，对图形界面常嗤之以鼻，认为那
是给脑子不够用的人使的；爱用图形界面的人，往往不知道还有命令行这回事。

其实就像男人和女人，往往只有当他们相遇一起的时候，才会产生更美好的东西：
爱情。

* 抛绣球

