cli+gui.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>当纯文本命令行碰到图形界面</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="当纯文本命令行碰到图形界面"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-03-17 23:55:04 CST"/>
<meta name="author" content="baohaojun"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="css/default.css" type="text/css">
 <link rel="shortcut icon" href="/poison.png" type="image/png" />


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">当纯文本命令行碰到图形界面</h1>

<p>很多人对很多事都会表现得很狂热。比如我自己，曾经一度说过这样的话：“我最
爱的是自由软件，最讨厌的是微软公司”。过了几年，有一次我把自己搞失业了，
居然去找在微软工作的同学说，嘿，哥们，能不能帮我推荐一下xxxx号职位？
</p>
<p>
这不是打自己脸么？
</p>
<p>
从那之后，我再也不敢轻易地说那种不知深浅的话了。其实微软的东西挺好的。
</p>
<p>
回到这篇文章的题目，命令行和图形界面。这两种界面特点非常鲜明，可以说水
火不相容。
</p>
<p>
命令行的优点是高效率。几乎可以完全用键盘操作；魔鬼筋肉人可以最大程度地
利用手指肌肉的机械化记忆而达到非常快的速度；头脑发达的可以组合使用各种
命令行工具达到自己的目的；最后非常容易自动化。
</p>
<p>
图形界面的优点则是直观。不是有句话叫一图抵千言么。一千个字写得累看得也
累；画一张图可能画得有趣看得也轻松。
</p>
<p>
而它们的缺点则刚好正是对方的优点。命令行用久了容易累，纯文本的东西需要
吸收消化，对脑子转速要求比较高；图形界面用久也容易累，因为它比较难自动
化，很多操作需要用鼠标完成。
</p>
<p>
由此带来的一个现象是，爱用纯文本界面的人，对图形界面常嗤之以鼻，认为那
是给脑子不够用的人使的；爱用图形界面的人，往往不知道还有命令行这回事。
</p>
<p>
其实就像男人和女人，往往只有当他们相遇一起的时候，才会产生更美好的东西：
爱情。
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 抛绣球</a></li>
<li><a href="#sec-2">2 互留电话号码</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 抛绣球</h2>
<div class="outline-text-2" id="text-1">


<p>
of/oc
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 互留电话号码</h2>
<div class="outline-text-2" id="text-2">

<p>up/swp
</p></div>
</div>
</div>

<div id="postamble">
    <hr/>
    <div style="float:left;width:160px;">
    <iframe width="100%" height="75" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=0&noborder=0&isWeibo=0&isFans=0&uid=1611427581&verifier=936f3b91&dpc=1"></iframe>
    </div>
    <div id="jiathis_style_32x32" style="float:left;margin-left:20px;margin-top:35px;">
        <a class="jiathis_button_tsina"></a>
        <a class="jiathis_button_douban"></a>
        <a class="jiathis_button_tqq"></a>
        <a class="jiathis_button_renren"></a>
        <a class="jiathis_button_douban9dian"></a>
        <!--<a class="jiathis_button_readitlater"></a>-->
        <!--<a class="jiathis_button_instapaper"></a>-->
        <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
        <!--<a class="jiathis_counter_style"></a>-->
    </div>
<script type="text/javascript">
    $(document).ready(function(){
        BYB.includeScript('http://v2.jiathis.com/code/jia.js',function(){})
    });
</script>


</div>
</body>
</html>
